In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
print("Module Loaded Successfully !!")

Module Loaded Successfully !!

In [2]:
# pd.concat
# pd.DataFrame.join
# pd.DataFrame.merge
# pd.DataFrame.apply
# pd.DataFrame.insert

In [3]:
a = np.random.randint(1,100,(5,5))

In [4]:
df = pd.DataFrame(a,columns=list("ABCDE"))

In [5]:
df

    A   B   C   D   E
0   6  19  39  29  69
1  75  15  48  85  99
2  25  30  39  33  19
3  39  34  25  98  19
4   3  53  44  11  48

In [6]:
df['A']

0     6
1    75
2    25
3    39
4     3
Name: A, dtype: int32

In [7]:
val = ["Munna","Raunak","Musu","Mine","Them"]
df.insert(0,"Name",val)

In [8]:
df

     Name   A   B   C   D   E
0   Munna   6  19  39  29  69
1  Raunak  75  15  48  85  99
2    Musu  25  30  39  33  19
3    Mine  39  34  25  98  19
4    Them   3  53  44  11  48

In [9]:
df['Name'].apply(lambda x : x.lower())

0     munna
1    raunak
2      musu
3      mine
4      them
Name: Name, dtype: object

In [10]:
df1 = df.copy()

In [11]:
df1

     Name   A   B   C   D   E
0   Munna   6  19  39  29  69
1  Raunak  75  15  48  85  99
2    Musu  25  30  39  33  19
3    Mine  39  34  25  98  19
4    Them   3  53  44  11  48

In [12]:
df

     Name   A   B   C   D   E
0   Munna   6  19  39  29  69
1  Raunak  75  15  48  85  99
2    Musu  25  30  39  33  19
3    Mine  39  34  25  98  19
4    Them   3  53  44  11  48

In [13]:
df1.iloc[:,2:]

    B   C   D   E
0  19  39  29  69
1  15  48  85  99
2  30  39  33  19
3  34  25  98  19
4  53  44  11  48

In [14]:
df1.iloc[:,2:] = df1.iloc[:,2:] + 2000

In [15]:
df1

     Name   A     B     C     D     E
0   Munna   6  2019  2039  2029  2069
1  Raunak  75  2015  2048  2085  2099
2    Musu  25  2030  2039  2033  2019
3    Mine  39  2034  2025  2098  2019
4    Them   3  2053  2044  2011  2048

In [16]:
pd.concat([df,df1])

     Name   A     B     C     D     E
0   Munna   6    19    39    29    69
1  Raunak  75    15    48    85    99
2    Musu  25    30    39    33    19
3    Mine  39    34    25    98    19
4    Them   3    53    44    11    48
0   Munna   6  2019  2039  2029  2069
1  Raunak  75  2015  2048  2085  2099
2    Musu  25  2030  2039  2033  2019
3    Mine  39  2034  2025  2098  2019
4    Them   3  2053  2044  2011  2048

In [17]:
pd.concat([df,df1],axis = 1)

     Name   A   B   C   D   E    Name   A     B     C     D     E
0   Munna   6  19  39  29  69   Munna   6  2019  2039  2029  2069
1  Raunak  75  15  48  85  99  Raunak  75  2015  2048  2085  2099
2    Musu  25  30  39  33  19    Musu  25  2030  2039  2033  2019
3    Mine  39  34  25  98  19    Mine  39  2034  2025  2098  2019
4    Them   3  53  44  11  48    Them   3  2053  2044  2011  2048

In [18]:
final_data = pd.concat([df,df1],ignore_index=True)

In [19]:
final_data

     Name   A     B     C     D     E
0   Munna   6    19    39    29    69
1  Raunak  75    15    48    85    99
2    Musu  25    30    39    33    19
3    Mine  39    34    25    98    19
4    Them   3    53    44    11    48
5   Munna   6  2019  2039  2029  2069
6  Raunak  75  2015  2048  2085  2099
7    Musu  25  2030  2039  2033  2019
8    Mine  39  2034  2025  2098  2019
9    Them   3  2053  2044  2011  2048

In [20]:
df1

     Name   A     B     C     D     E
0   Munna   6  2019  2039  2029  2069
1  Raunak  75  2015  2048  2085  2099
2    Musu  25  2030  2039  2033  2019
3    Mine  39  2034  2025  2098  2019
4    Them   3  2053  2044  2011  2048

In [21]:
print(df,end='\n'*3)
print(df1)

     Name   A   B   C   D   E
0   Munna   6  19  39  29  69
1  Raunak  75  15  48  85  99
2    Musu  25  30  39  33  19
3    Mine  39  34  25  98  19
4    Them   3  53  44  11  48


     Name   A     B     C     D     E
0   Munna   6  2019  2039  2029  2069
1  Raunak  75  2015  2048  2085  2099
2    Musu  25  2030  2039  2033  2019
3    Mine  39  2034  2025  2098  2019
4    Them   3  2053  2044  2011  2048

In [22]:
display(df)
display(df1)

     Name   A   B   C   D   E
0   Munna   6  19  39  29  69
1  Raunak  75  15  48  85  99
2    Musu  25  30  39  33  19
3    Mine  39  34  25  98  19
4    Them   3  53  44  11  48

     Name   A     B     C     D     E
0   Munna   6  2019  2039  2029  2069
1  Raunak  75  2015  2048  2085  2099
2    Musu  25  2030  2039  2033  2019
3    Mine  39  2034  2025  2098  2019
4    Them   3  2053  2044  2011  2048

In [23]:
## Join

In [24]:
data1 = pd.Series([12,344,656,345],name="Salary")
data2 = pd.Series(np.random.randint(1,1000,4),name="Month")

In [25]:
data1

0     12
1    344
2    656
3    345
Name: Salary, dtype: int64

In [26]:
data2

0    698
1    650
2    941
3    485
Name: Month, dtype: int32

In [27]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [28]:
display(df1)
display(df2)

   Salary
0      12
1     344
2     656
3     345

   Month
0    698
1    650
2    941
3    485

In [29]:
df1.join(df2)

   Salary  Month
0      12    698
1     344    650
2     656    941
3     345    485

In [30]:
df1 = pd.DataFrame({
    "Name": ["Aman", "Rohit"],
    "Marks": [80, 85]
})

df2 = pd.DataFrame({
    "Name": ["Priya", "Neha"],
    "Marks": [90, 95]
})

In [32]:
result = pd.concat([df1, df2])
display(result)

    Name  Marks
0   Aman     80
1  Rohit     85
0  Priya     90
1   Neha     95

In [33]:
pd.concat([df1, df2], axis=1)

    Name  Marks   Name  Marks
0   Aman     80  Priya     90
1  Rohit     85   Neha     95

In [35]:
result = pd.concat([df1, df2],ignore_index=True)
display(result)

    Name  Marks
0   Aman     80
1  Rohit     85
2  Priya     90
3   Neha     95

In [36]:
df1 = pd.DataFrame({
    "Name": ["Aman", "Rohit"],
    "Marks": [80, 85]
})

df2 = pd.DataFrame({
    "City": ["Delhi", "Mumbai"]
})

result = df1.join(df2)
display(result)

    Name  Marks    City
0   Aman     80   Delhi
1  Rohit     85  Mumbai

In [ ]:
df1 = pd.DataFrame({
    "ID": [1, 2],
    "Name": ["Aman", "Rohit"]
})

df2 = pd.DataFrame({
    "ID": [1, 2],
    "Marks": [80, 85]
})

result = pd.merge(df1, df2, on="ID")
dis(result)